IDEA Open Model
ErrorMessage Properties
The ErrorMessage type exposes the following members.
Properties
Name | Description
Description
 Description of message
 (Inherited from OpenMessage.)
InnerMessage
 Inner message
 (Inherited from OpenMessage.)
Message
 Gets the Message
 (Overrides OpenMessage.Message.)
Number
 Number of message
 (Inherited from OpenMessage.)
Object
 Affected object
 (Inherited from OpenMessage.)
PropertyName
 Affected property name
 (Inherited from OpenMessage.)
PropertyValue
 Gets the value of affected property
 (Inherited from OpenMessage.)
Top
See Also
Reference
ErrorMessage Class
IdeaRS.OpenModel.Message Namespace